fabkury/p64/firmware/sdkconfig.defaults
# p64 firmware: ESP-IDF defaults for the Waveshare ESP32-S3-RGB-Matrix board.
# Only deviations from ESP-IDF's own defaults are listed. The generated
# sdkconfig is ignored by git; edit this file (or run `idf.py save-defconfig`).

CONFIG_IDF_TARGET="esp32s3"

# --- Module: ESP32-S3-WROOM-2-N32R16V (32 MB octal flash, 16 MB octal PSRAM) ---
CONFIG_ESPTOOLPY_OCT_FLASH=y
CONFIG_ESPTOOLPY_FLASHMODE_OPI=y
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_DTR=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Boot even if the PSRAM does not answer, so a wrong RAM setting is a log line, not a brick.
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# --- Partition table (two 4 MB OTA slots + storage), see partitions.csv ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Console: the board's USB port is wired to the ESP32-S3's native USB (no UART bridge) ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- TLS: hardware AES and SHA (ESP-IDF defaults), which constrains the HUB75 clock ---
# The hardware AES/SHA engines stream through GDMA and their bursts starve the panel's
# LCD_CAM FIFO when the panel's own DMA stream is fast; the panel then stops for good.
# Verified on 2026-09-12: at 32 MHz (64 MB/s) stalls within seconds of the first HTTPS
# request with either engine on; none at 20 MHz (40 MB/s); none at 32 MHz with
# software crypto. Keep the panel at 20 MHz while these are on, or set both to n
# before raising the clock.
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y

# --- Network throughput (measured 2026-09-12, see README "Network throughput") ---
# lwIP's default 5.7 KB TCP window caps a download at 5.7 KB per round trip: 55 KB/s
# from a server 100 ms away, 25 KB/s from makapix.club 220 ms away. A 64 KB window and
# a deeper receive mailbox lift those to 600 KB/s and up to 220 KB/s. lwIP buffers go
# to PSRAM. TLS buffers use the default allocator: internal RAM first (faster: 460-510
# KB/s vs 240-390 KB/s from a nearby CDN with everything in PSRAM), PSRAM when internal
# RAM is short. Internal-only allocation (MBEDTLS_INTERNAL_MEM_ALLOC) failed mid-download
# twice on 2026-09-13 ("Dynamic Impl: alloc(13334 bytes) failed") once the HTTP server
# and mDNS were added: with the 8-bit panel buffers about 35-40 KB of internal RAM is
# free at run time. Buffers are released between records (DYNAMIC_BUFFER).
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# --- CPU / RTOS / compiler ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# Rendering runs in the main task on core 1; Wi-Fi, lwIP and the event loop stay on
# core 0, so network traffic cannot delay the frame-locked present.
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# --- HUB75 driver (esphome/esp-hub75): Waveshare ESP32-S3-RGB-Matrix pin map ---
# From the board schematic and Waveshare's own sdkconfig.defaults.
CONFIG_HUB75_BOARD_CUSTOM=y
CONFIG_HUB75_PIN_R1=4
CONFIG_HUB75_PIN_G1=5
CONFIG_HUB75_PIN_B1=6
CONFIG_HUB75_PIN_R2=7
CONFIG_HUB75_PIN_G2=15
CONFIG_HUB75_PIN_B2=16
CONFIG_HUB75_PIN_A=18
CONFIG_HUB75_PIN_B=8
CONFIG_HUB75_PIN_C=3
CONFIG_HUB75_PIN_D=42
CONFIG_HUB75_PIN_E=9
CONFIG_HUB75_PIN_LAT=40
CONFIG_HUB75_PIN_OE=2
CONFIG_HUB75_PIN_CLK=41

# --- HUB75 panel: Waveshare RGB-Matrix-P2-64x64 (1/32 scan) ---
CONFIG_HUB75_PANEL_WIDTH=64
CONFIG_HUB75_PANEL_HEIGHT=64
CONFIG_HUB75_WIRING_STANDARD=y
# Driver IC unconfirmed; Waveshare's Arduino demos use FM6126A. Switch to
# CONFIG_HUB75_DRIVER_GENERIC=y if the panel stays dark or shows garbage.
CONFIG_HUB75_DRIVER_FM6126A=y
CONFIG_HUB75_LAYOUT_ROWS=1
CONFIG_HUB75_LAYOUT_COLS=1
CONFIG_HUB75_LAYOUT_HORIZONTAL=y
# ROTATE_0 = panel-native orientation (row 63 is the edge marked "down" by the
# bouncing ball). The enclosure mounts the panel turned 90 degrees; switch to
# ROTATE_90 or ROTATE_270 once that is known.
CONFIG_HUB75_ROTATE_0=y

# --- HUB75 quality / performance ---
# The vendored driver (components/esp-hub75, "p64 patch") sends the bit planes above the
# transition bit T 1, 2, 4, ... times per frame and the planes at or below T once each
# with a halving output-enable window, so every plane keeps its binary weight:
#   frame time = 32 rows x (T + 2^(bits-1-T)) transmissions x 64 px / 20 MHz,
#   T = the smallest value that reaches HUB75_MIN_REFRESH_RATE.
# 10 bits, T=4 (min refresh 250): 36 transmissions per row, 271.3 Hz, 1024 codes per
# channel. Output-enable windows for planes 0..4 are 1, 3, 7, 15 and 31 pixel clocks
# (50 ns to 1.55 us), 62 for planes 5..9; the 50 ns pulse of plane 0 (1/1979 of full
# scale) may give little light, everything from plane 1 (150 ns) up is solid. Chosen on
# 2026-09-13 over T=3 (145.8 Hz, all ten planes solid) for band-free phone photos at
# 1/270 s or longer. Before (8 bits, T=0, 76 Hz) dark artwork showed 2-3 shades: the
# darkest quarter of the input range had 11 codes, now 25-49. Gamma 2.2 matches the
# sRGB monitors the artwork was made on (CIE 1931 rendered the mid-tones darker).
# 20 MHz stays: the hardware AES/SHA engines (TLS) and, later, the SD card share the
# GDMA/AHB bandwidth, and 32 MHz stalled the panel with hardware crypto (TLS section).
# Next steps if ever wanted: min refresh 400 -> T=5, 465 Hz, plane 0 without a window
# and plane 1 at 50 ns (dark quarter 13-25 codes); 600 -> T=6, 698 Hz (7-14 codes).
CONFIG_HUB75_BIT_DEPTH_10=y
CONFIG_HUB75_GAMMA_2_2=y
CONFIG_HUB75_CLK_20MHZ=y
CONFIG_HUB75_MIN_REFRESH_RATE=250
CONFIG_HUB75_LATCH_BLANKING=1
CONFIG_HUB75_BRIGHTNESS=255
CONFIG_HUB75_DOUBLE_BUFFER=y
CONFIG_HUB75_IRAM_OPTIMIZATION=y

# --- Network name: the DHCP hostname (router client list) matches the mDNS name p64.local ---
CONFIG_LWIP_LOCAL_HOSTNAME="p64"
